describe('баннер', function() {
    it('должен откручаваться при активном статусе', function() {

    });
    
    it('должен показываться только в интревал между датами начала и завершения открутки', function() {

    });

    it('должен показываться ограниченое кол-ов раз в час при равномерной скорости открутки', function() {

    });

    it('должен показываться чаще других при более высоком приоритете', function() {

    });

    it('должен показываться, пока не наберет ограничения по показам всего', function() {

    });
    
    it('должен показываться, пока не наберет ограничения по показам в сутках', function() {

    });

    it('должен показываться для пользователя, пока не наберет ограничения по показам', function() {

    });

    it('должен показываться не чаще мин. интревала для одного пользователя', function() {

    });
});