describe('сценарий', function() {
    it('должен откручаваться при активном статусе', function() {

    });

    it('не должен проверят таргетинг когда он не включен', function() {

    });

    it('должен показываться только в интревал между датами начала и завершения открутки', function() {

    });

    it('должен показываться только в указаныое время дня с таргетингом по дням недели', function() {

    });

    it('должен показываться только пользователям из указаных городов с таргетингом по географии', function() {

    });

    it('должен показываться только пользователям с указаных ip с таргетингом по ip', function() {

    });

    it('должен показываться только пользователям с указаными uset-agent с таргетингом по user-agent', function() {

    });

    it('должен показываться только на указаных сайтах с таргетингом по сайтам', function() {

    });

    it('не должен проверят все включеные таргетинги', function() {

    });
});