describe('banner', function() {
    it('should откручаваться при активном статусе', function() {

    });
    
    it('should показываться только в интревале между датами начала и завершения открутки', function() {

    });

    it('should показываться ограниченое кол-ов раз в час при равномерной скорости открутки', function() {

    });

    it('should показываться чаще других при более высоком приоритете', function() {

    });

    it('should показываться, пока не наберет ограничения по показам всего', function() {

    });
    
    it('should показываться, пока не наберет ограничения по показам в сутках', function() {

    });

    it('should показываться для пользователя, пока не наберет ограничения по показам', function() {

    });

    it('should показываться не чаще мин. интревала для одного пользователя', function() {

    });
});